/* 
	課題名:Kad
	クラス:
	作成者:
	作成日:
*/

public class Kad09_3{
	public static void main(String[] args){
		/** 宣言 **/
		//一辺の長さを固定する変数
		
		// 図形を表示するための元となる2次元配列
		char[][] triangle = {{'■','□','□','□','□'},
							 {'■','■','□','□','□'},
							 {'■','■','■','□','□'},
							 {'■','■','■','■','□'},
							 {'■','■','■','■','■'}};
		
		/** 実行処理 **/
		//上部を表示するためのループ
		
			//上部左側を表示するためのループ
			
				// 配列の値を表示
				
			
			//上部右側を表示するためのループ
			
				// 配列の値を表示
				
			
			//1行の最後に改行処理
			
		
		
		//下部を表示するためのループ
		
			//下部左側を表示するためのループ
			
				// 配列の値を表示
			
			
			//下部右側を表示するためのループ
			
				// 配列の値を表示
				
			
			//1行の最後に改行処理
			
		
	}
}