/*
配列内の最小値を表示する
プログラムを作成してください

[実行結果]

50,70,30,
80,60,10,
40,20,90,

最小値は10です。

*/

class Sample10_3a{
	public static void main(String[] args){
		/** 宣言 **/
		int[][] table = {{50, 70, 30},
						 {80, 60, 10},
				 	 	 {40, 20, 90}};
		
		//先頭要素を最小値の初期値にする
		int min =    ;	//最小値
		
		/** 実行処理 **/
		//tableの行数分繰り返すループ
		
			//rowの列数分繰り返すループ
			
				//カンマ区切りで値表示
				
				//もし表示した値が現在の最小値より小さい場合
				
					//最小値を現在参照している値で更新
					
				
			
			//1行の終わりに改行
			System.out.println("");	
		
		System.out.println("\n最小値は" +     +  "です。");
	}
}
