/* 
	課題名:Kad
	クラス:
	作成者:
	作成日:
*/

// Scanerを使用するためのimport文

public class Kad06_2{
	public static void main(String[] args){
		/* 変数宣言 */
		// Scanner
		
		// 整数入力用
		
		// 継続フラグ用 [0->終了 1->継続]
		
		
		
		/* 後判定 繰り返し処理 ここから*/
		
			// 「"整数＞"」を表示
			
			// キーボードで入力し値を代入
			
			
			// もし入力した整数が偶数なら
			
				// 「"偶数です"」と表示する
				
			// それ以外なら
			
				// 「"奇数です"」と表示する
				
			
			
			// 「"[0->終了 1->継続]＞"」と表示する
			
			// キーボードで入力し継続フラグ用へ代入する
			
				
		/* 後判定 繰り返し処理 ここまで*/
		// 継続フラグが1なら繰り返す
		
		
		// 「"終了します。"」と表示する
		
	}
}
