/* 
	課題名:Kad
	クラス:
	作成者:
	作成日:
*/

// Scanerを使用するためのimport文

public class Kad06_3{
	public static void main(String[] args){
		/* 変数宣言 */
		// Scanner
		
		// 合計値
		
		// 入力カウント
		
		// 数値入力用

		
		
		
		/* 無限ループ */
		
			/*** 繰り返したい処理 ここから ***/
			
			// 「"整数" + 入力カウント数 + "＞"」の内容を表示
			
			// キーボードで入力した値を数値入力用へ代入
			
			
			//もし入力した値が0の場合
			
				// ループ終了処理
				
			
			
			// 合計値に入力値を加算する
			
			// 入力回数を1増やす
			
			/*** 繰り返したい処理 ここまで ***/
		
		
		//もし入力回数が0じゃない場合
		
			// 「"合計値は" + 合計金額 + "で平均値は" + 合計金額/入力カウントの計算 + "です"」の内容を表示する
			
		
	}
}
