/*
	生徒名が格納されている配列を活用し
	全生徒名と人数を表示するプログラムを完成させよ


*/

/*

[実行結果]
1人目足立さん
2人目石原さん
3人目上野さん
.
.
.

以上合計○○人

// ※○○には実際の人数が入ります！
*/

class FukuEx04_6{
	public static void main(String[] args){
		// 宣言
		
		// 1年の生徒一覧
		String names[] = {"足立","石原","上野","山田","田中","森本","橋井","木村","水門","源田","林","二又","高橋","山本","大林","上野","脇本","有栖川","石橋","村田","奥本","井上","円満字","太田","佃","荒木","小林","大西","辻","森本","石原","上野","山田","田中","森本","橋井","木村","上野","山田","田中","足立","石原","上野","山田","田中","森本","橋井","木村","水門","源田","林","二又","高橋","山本","大林","上野","脇本","有栖川","石橋","村田","奥本","井上","円満字","太田","佃","荒木","小林","大西","辻","森本","石原","上野","山田","田中","森本","橋井","木村","上野","山田","田中","足立","石原","上野","山田","田中","森本","橋井","木村","水門","源田","林","二又","高橋","山本","大林","上野","脇本","有栖川","石橋","村田","奥本","井上","円満字","太田","佃","荒木","小林","大西","辻","森本","石原","上野","山田","田中","森本","橋井","木村","上野","山田","田中"
							,"田中","森本","橋井","林","勝本","村田","足立","石原","上野","山田","田中","森本","橋井","木村","水門","源田","林","二又","高橋","山本","大林","上野","脇本","有栖川","石橋","村田","奥本","井上","円満字","太田","佃","荒木","小林","大西","辻","森本","石原","上野","山田","田中","森本","橋井","木村","上野","山田","田中",};
		
			
			System.out.println( + "人目" +   + "さん");
		
		// 全生徒の人数を表示
		System.out.println("以上合計"+  +"人");
	}
}
