
/*
	配列のプログラムに松下さんも追加して
	松下さんも表示してください
	
	[実行結果]
	田中さん45点
	山中さん77点
	足立さん37点
	松下さん90点
*/

class FukuEx04_3{
	public static void main(String[] args){
		/*******
		* 宣言 *
		********/
		// 名簿の配列
		String names[] = {"田中","山中","足立"};// 配列に要素を追加してください
		// 得点の配列(45点,77点,37点,90点)
		
		
		/***********
		* 実行処理 *
		************/
		// 名簿の0番目を表示
		System.out.println(names[0] + "さん" +   + "点");
		// 名簿の1番目を表示
		System.out.println(names[1] + "さん"+   + "点");
		// 名簿の2番目を表示
		System.out.println(names[2] + "さん"+   + "点");
		// 追加で名簿の3番目を表示
		
		
	}
}