public class Kad18_1{
	
	/* 選択ソート */
	public static 戻り値の型 メソッド名(引数の型 引数名) {
		int comit;				// 確定させる位置
		int target;				// 比較対象の位置
		int pos;			// 最小値の位置
		int tmp;			// 入れ替え時に使用する空の箱
		
		// [確定させる位置]が配列の末尾-1まで繰り返す
		
			//最小値の位置を設定：初期値として[確定させる位置]を設定
			
			
			// [比較対象の位置]が配列の末尾まで繰り返す
			
				
				// [配列内の比較対象の値]より[配列内の最小値の値]の方が大きい場合
				
					// 最小値の位置を比較対象の位置で更新
					
				
			
			//[配列内の最小値の値]と[配列内の確定させる値]を入れ替える
			
			
			
			
			配列の値を表示する自作メソッドを呼ぶ	//配列の値を表示
		
	}
	
	//配列の値表示
	public static 戻り値の型 メソッド名(引数の型 引数名) {
		
		
	}
	
	public static void main(String[] args) {
		
		int[] numbers = {2, 5, 8, 1, 4, 7, 3, 6, 9, 0};
		
		System.out.println("********* 元データ *********");
		配列の値を表示する自作メソッドを呼ぶ	//配列の値を表示
		System.out.println("****** 選択ソート開始 ******");
		選択ソートを行う自作メソッドを呼ぶ		//選択ソートで並び替え
		System.out.println("****** 選択ソート完了 ******");
	}
}
