public class Kad18_2{
	
	//バブルソート
	public static 戻り値の型 メソッド名(引数の型 引数名){
		int comit;	// 確定させる位置
		int pos;	// 最大値の位置
		int tmp; 	// 入れ替え時に使用する空の箱
		
		// 確定させる位置が末尾から先頭まで繰り返す
		
			// 最大値の位置が先頭から確定させる位置まで繰り返す
			
				// もし配列の最大値より配列の最大値の位置+1の値の方が小さい場合
				
					/* 入れ替え処理 */
					
					
					
				
			
			//配列の値を表示
			自作の配列表示メソッドを呼ぶ						
		
	}

	//配列表示メソッド
	public static 戻り値の型 メソッド名(引数の型 引数名) {

	
	}
	
	public static void main(String[] args) {
		int[] num = {22, 50, 88, 11, 44, 70, 30, 66, 90, 6};
		
		System.out.println("--------- 元データ ---------");
		自作の配列表示のメソッドを呼ぶ
		System.out.println("----- バブルソート開始 -----");
		自作のバブルソートメソッドを呼ぶ;
		System.out.println("----- バブルソート完了 -----");
	}
}
