/* 
	課題名:Kad
	クラス:
	作成者:
	作成日:
*/

public class Kad08_3{
	public static void main(String[] args){
		/** 宣言  **/
		char[] letters = {'E', 'C', 'C', 'コ', 'ン', 'ピ', 'ュ', 'ー', 'タ'};
		
		System.out.println("配列の値を逆順に並び替えて先頭から表示します。");
		
		/*交換処理*/
		// 添え字が列の先頭から～列の真ん中に来るまで繰り返す ここから
		
			
			//添え字番目の値を一時退避させる
			
			
			// lettersの添え字番目にlettersの[配列の長さ - (今の添え字 + 1)]番目の値を代入する
			
			
			// lettersの(配列の長さ - 今の添え字)番目に一時退避させた値を代入する
			
		
		// 添え字が列の先頭から～列の真ん中に来るまで繰り返す ここまで
		
		/*表示処理*/
		// 先頭から最後尾まで繰り返す
		
			// lettersの[添え字]番目の値を表示
			
		
	}
}
