/* 
	課題名:Kad
	クラス:
	作成者:
	作成日:
*/

// Scannerのimport文


public class Kad08_2{
	public static void main(String[] args){
		/** 宣言  **/
		// Scanner
		
		// 10進数入力用
		
		// 進数変換用の配列 長さ256
		
		// 配列の添え字用
		
		
		/** 実行処理 **/
		// ["10進整数を2進数に変換します。"]の内容を表示する
		System.out.println("10進整数を2進数に変換します。");
		
		// ["10進整数＞"]の内容を表示する
		System.out.print("10進整数＞");
		
		// 10進数入力用にキーボードから入力した数値を代入する
		

		// 配列の添え字用を0で初期化しておく
		
		
		/**2進数に変換し配列へ格納**/
		// 10進数入力用の値がよりも大きい間繰り返す  ここから
		
		
			// 進数変換用の配列の[配列の添え字用]番目に10進数入力用の値に2で剰余演算した結果を代入
			
		
			// 10進数入力用の値を半分にする
			
		
			// 配列の添え字用に1加算する
			
		
		
		// 10進数入力用の値がよりも大きい間繰り返す  ここまで
		
	
		// ["2進数："]の内容を表示
		System.out.print("2進数：");
		/*配列の末尾から先頭まで順に表示*/
		// 配列の添え字が0より大きい間繰り返す ここから
		
			// 配列の添え字用を1減らす
			
	
			// 配列の「[配列の添え字用]番目の値を表示する
			
		
		// 配列の添え字が0より大きい間繰り返す ここまで
	
	}
}
