/*
①6面ダイスを2個振ったときの出目の合計を表示せよ。
②合計値の出た回数をグラフで表示せよ。

（実行結果）
6面ダイスを2個振った出目の合計を表示します！
振る回数＞500
1回目：2 + 3 = 5
2回目：6 + 6 = 12
3回目：5 + 2 = 7
4回目：4 + 1 = 5
5回目：4 + 2 = 6
6回目：2 + 4 = 6
7回目：4 + 3 = 7
8回目：4 + 6 = 10
9回目：2 + 1 = 3
10回目：2 + 1 = 3

（長いので省略）

499回目：2 + 1 = 3
500回目：3 + 2 = 5

合計値の回数を表示します！
合計値[2]*************
合計値[3]********************************
合計値[4]**************************************
合計値[5]************************************************************
合計値[6]********************************************************
合計値[7]********************************************************************************************
合計値[8]********************************************************************
合計値[9]*******************************************************
合計値[10]*****************************************
合計値[11]*******************************
合計値[12]**************



*/



public class Ex11_1 {
	public static void main(String[] args) {
		final int MAXROLL = 6;
		
		System.out.println("6面ダイスを2個振った出目の合計を表示します！");
		System.out.print("振る回数＞");
		int count = sc.nextInt();
		
			System.out.println(     + "回目：" +    + " + " +    + " = " +       );

		
		System.out.println();
		
		System.out.println("合計値の回数を表示します！");
			System.out.print("合計値[" +    + "]");
		
				System.out.print("*");
		
			System.out.println();
	}
}
