public class Kad10_3{
	public static void main(String[] args){
		/** 宣言 **/
		int[][] table = {{50, 70, 30},
						 {80, 60, 10},
						 {40, 20, 90}};
		
		/*先頭要素を最小値と最大値の初期値にする*/
		//最小値
		
		//最大値	
		
		//合計値		
					
		
		/** 実行処理 **/
		System.out.println("二次元配列から最小値・最大値・合計値を求めます。\n");
		
		//配列の行数文繰り返す
		
			//配列内の要素分繰り返す
			
				//カンマ区切りで値表示
				
				
				//もし表示した値が現在の最小値より小さい場合
				
					//最小値の値を更新
					
				
				
				//もし表示した値が現在の最大値より大きい場合
				
					//最大値の値を更新
					
				
				//合計値へ参照している値を加算
				
			
			//1行の終わりに改行
			System.out.println("");	
		}
		// 結果を表示
		System.out.println("\n最小値は" +      + "で、" + "最大値は" +     + "で、" + "合計値は" +      + "です。");
	}
}
