/* 
	課題名:SouFuku2_10
	クラス:
	作成者:
	作成日:
*/

/*
	

	[実行結果]
	0から[キーボードから入力した値]まで
	順に足した結果を表示するプログラムを完成させよ
	
	例:10を入力
	0 + 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10 = 55
	
	その際、以下のメソッドを作成すること
	----------------------
	メソッド名:sumNum
	引数:int num
	戻り値:int
	
	メソッドの処理：渡された値まで0から順番に加算した結果を返す
	----------------------

	[実行結果]10を入力したパターン
	数値を入力してください:10
	55
	
	[実行結果]20を入力したパターン
	数値を入力してください:20
	210
	
	[実行結果]aを入力したパターン
	数値を入力してください:a
	入力値が不正です

*/

public class SouFuku2_10{
	
	
	public static void main(String[] args) {

		
	}
}
