/* 
	課題名:SouFuku2_08
	クラス:
	作成者:
	作成日:
*/

/*
	選択ソート又はバブルソートを使って【昇順】に並び替えを行いなさい
	              (小さい方から順に)

	[実行結果]
	********* 元データ *********
	2, 5, 8, 1, 4, 7, 3, 6, 9, 0,
	****** 選択ソート開始 ******
	0, 5, 8, 1, 4, 7, 3, 6, 9, 2,
	0, 1, 8, 5, 4, 7, 3, 6, 9, 2,
	0, 1, 2, 5, 4, 7, 3, 6, 9, 8,
	0, 1, 2, 3, 4, 7, 5, 6, 9, 8,
	0, 1, 2, 3, 4, 7, 5, 6, 9, 8,
	0, 1, 2, 3, 4, 5, 7, 6, 9, 8,
	0, 1, 2, 3, 4, 5, 6, 7, 9, 8,
	0, 1, 2, 3, 4, 5, 6, 7, 9, 8,
	0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
	****** 選択ソート完了 ******
*/

public class SouFuku2_08{	
	public static void main(String[] args) {
	int[] numbers = {2, 5, 8, 1, 4, 7, 3, 6, 9, 0};
	
	}
}
