/* 
	課題名:Kad
	クラス:
	作成者:
	作成日:
*/





// Scannerのimport文

public class Kad07_2{
	public static void main(String[] args){
		/* 宣言 */
		// 行数用
		
		// 列数用
		
		// Scanner
		
		/* 実行処理 */
		
		// ["四角形を描画します。"]を表示
		
		
		// ["行数＞"]を表示
		
		// キーボードで入力した値を行数用の変数に代入する
		
		
		// ["列数＞"]を表示
		
		// キーボードで入力した値を列数用の変数に代入する
		
		
		//行のループ(iを1から始めて入力した行数以下の間繰り返し、繰り返す毎にiを1ずつ増やす) ここから
		
			//列のループ(jを1から始めて入力した列数以下の間繰り返し、繰り返す毎にjを1ずつ増やす) ここから
			
				// ["□"]を表示する
				
			//列のループ(jを1から始めて入力した列数以下の間繰り返し、繰り返す毎にjを1ずつ増やす) ここまで
			
			//行の最後に改行を表示
			
		//行のループ(iを1から始めて入力した行数以下の間繰り返し、繰り返す毎にiを1ずつ増やす) ここまで
		
	}
	
}
