/* 
	課題名:Kad
	クラス:
	作成者:
	作成日:
*/


public class Kad07_3{
	public static void main(String[] args){
		/* 実行処理 */
		
		// ["  |"]を表示
		
		
		// 列の1～9の値を表示するループ(iを1から始めて入力した行数以下の間繰り返し、繰り返す毎にiを1ずつ増やす)ここから
		
			//System.out.printf("%2d", 1); で数字2桁を表示する
			
		// 列の1～9の値を表示するループ(iを1から始めて入力した行数以下の間繰り返し、繰り返す毎にiを1ずつ増やす)ここまで
		
		
		//罫線の["\n------------------------------"]のを表示する
		
		
		//行の段のループ(iを1から始めて9以下の間繰り返し、繰り返す毎にiを1ずつ増やす) ここから
		
			//System.out.printf(("%2d|", i)); で左の何段目かを表示する
			
			//列の値のループ(jを1から始めて9以下の間繰り返し、繰り返す毎にjを1ずつ増やす) ここから
			
				//System.out.printf("%2d ", i*j); で(段数 x 列の値)の計算結果を表示する
				
			//列の値のループ(jを1から始めて9以下の間繰り返し、繰り返す毎にjを1ずつ増やす) ここまで
			
			//1段ごとの最後に改行処理
		
		//行の段のループ(iを1から始めて9以下の間繰り返し、繰り返す毎にiを1ずつ増やす) ここまで
		
	}
}
